class MessageFont:
    start = "<b>Привет!</b>\n\nЭто бот SmokeTree, здесь ты можешь приобрести "\
        "Жидкости для вейпов\n\nСмотри каталог по кнопке внизу и выбирай, что по душе"


class CatalogFont:
    introductory_page = "Выбери фильтры или начни сразу смотреть каталог"
    filters_page = "Выбери фильтры"
    filter_page = "Выбери значение фильтра"
    write_price = "Введи цену товара"
    not_correct_price = "Ты ввел что-то не то, поробуй еще раз"
    end_of_select_price = "Ты ввел цену"


class SearchFont:
    search_product = "Выбери товар"
    card_item = "<b>{}</b>\n\n🏷️ Бренд - {}\n🍏 Вкус - {}\n🧴 Объем - {}\n🧪 Тип никотина - {}\n"\
        "🧊 Холодок - {}\n\n💰 Цена - {}"
    search_by_name = "Введи название товара"
    incorrect_name = "Не существует такого товара"
